_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УчетРаботыСотрудниковТехники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_УчетРаботыСотрудниковТехники</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УСОERP_ТабельИсполнителейРабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУтверждения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Табель</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемРабот</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоставРесурса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СоставРесурсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностьТипМашинМеханизмов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
								<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СотрудникОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиРесурса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_ПотребностьВРесурсах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_ПотребностьВРесурсах</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагрузкаПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Трудоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Машиноемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыПланированияСтроительныхРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_Ресурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_Ресурсы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Рабочие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Механизмы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипМеханизма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СоставРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_СоставРесурсов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Рабочие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Механизмы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипМеханизма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Механизм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УчетРаботыСотрудниковТехники/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
		
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли; 
	
	НовыйВариант = Объект.ДокументУтверждения.СценарийПланирования.НовыйВариант = Истина;

	ЗаполнитьДеревоЗначенийПриСоздании();
	ОтобразитьПо = "Исполнителям";
	ОтобразитьПоПриИзмененииНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПрисвоитьЗаголовкиКолонкам();
	РазвернутьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТабличнаяЧастьТабель = ТекущийОбъект.Табель;
	ТабличнаяЧастьТабель.Очистить();
	
	ЗаполнитьТабличнуюЧастьТабельИзДереваЗначений(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ТабличнаяЧастьТабель = ТекущийОбъект.Табель;
	ТабличнаяЧастьТабель.Очистить();
	РеквизитТабельДеревоЗначений = РеквизитФормыВЗначение("ТабельДеревоЗначений", Тип("ДеревоЗначений"));	
	УСОERP_ОбработкаТабличныхЧастей.ЗаполнитьТаблицуИзДереваЗначений(РеквизитТабельДеревоЗначений, ТабличнаяЧастьТабель);  
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	Объект.ОкончаниеПериода = Объект.НачалоПериода + 86400*6;
	ПрисвоитьЗаголовкиКолонкам();
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеПериодаПриИзменении(Элемент)
	Объект.НачалоПериода = Объект.ОкончаниеПериода - 86400*6;
	ПрисвоитьЗаголовкиКолонкам();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСтроительстваПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСтроительстваОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокиТабеля = ТабельДеревоЗначений.ПолучитьЭлементы();
	Если СтрокиТабеля.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Очистить табличную часть «Табель»?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ОчиститьТабель", ЭтаФорма, Объект.ОбъектСтроительства);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьПоПриИзменении(Элемент)
	ОтобразитьПоПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовДереваФормыТабель

&НаКлиенте
Процедура РаботаРесурсПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТабельДеревоЗначений.ТекущиеДанные;
	ОбработатьВыборРесурсаНаСервере(ТекущаяСтрока.ПолучитьИдентификатор());
	Элементы.ТабельДеревоЗначений.Развернуть(ТекущаяСтрока.ПолучитьИдентификатор());

КонецПроцедуры

&НаКлиенте
Процедура ТабельДеревоЗначенийСоставРесурсаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТабельДеревоЗначений.ТекущиеДанные;
	ОбработатьВыборСоставаРесурсаНаСервере(ТекущаяСтрока.ПолучитьИдентификатор());
	Элементы.ТабельДеревоЗначений.Развернуть(ТекущаяСтрока.ПолучитьИдентификатор());

КонецПроцедуры

&НаКлиенте
Процедура КоличествоЧасов1ПриИзменении(Элемент)
	ОтобразитьПоПриИзмененииНаСервере()
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЧасов2ПриИзменении(Элемент)
	ОтобразитьПоПриИзмененииНаСервере()
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЧасов3ПриИзменении(Элемент)
	ОтобразитьПоПриИзмененииНаСервере()
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЧасов4ПриИзменении(Элемент)
	ОтобразитьПоПриИзмененииНаСервере()
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЧасов5ПриИзменении(Элемент)
	ОтобразитьПоПриИзмененииНаСервере()
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЧасов6ПриИзменении(Элемент)
	ОтобразитьПоПриИзмененииНаСервере()
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЧасов7ПриИзменении(Элемент)
	ОтобразитьПоПриИзмененииНаСервере()
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	РазвернутьНаКлиенте(); 
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяСтрока(Команда)
	
	ТекущаяСтрока = Элементы.ТабельДеревоЗначений.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.СоставРесурса) Тогда
		Если ТекущаяСтрока.ЭтоРесурс Тогда
			СтрокиСостава = ТекущаяСтрока.ПолучитьЭлементы();
			НоваяСтрока = СтрокиСостава.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.ЭтоРабота 		= Ложь;
			НоваяСтрока.ЭтоРесурс 		= Ложь;
			НоваяСтрока.Работа 			= ТекущаяСтрока.Работа;
			НоваяСтрока.Ресурс 			= ТекущаяСтрока.Ресурс;
			НоваяСтрока.СоставРесурса 	= ТекущаяСтрока.СоставРесурса;

			Элементы.ТабельДеревоЗначений.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Иначе
			Родитель = ТекущаяСтрока.ПолучитьРодителя();
			СтрокиСостава = Родитель.ПолучитьЭлементы();
			НоваяСтрока = СтрокиСостава.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Родитель);
			НоваяСтрока.ЭтоРабота 		= Ложь;
			НоваяСтрока.ЭтоРесурс 		= Ложь;
			НоваяСтрока.Работа 			= Родитель.Работа;
			НоваяСтрока.Ресурс 			= Родитель.Ресурс;
			НоваяСтрока.СоставРесурса 	= Родитель.СоставРесурса;
			
			Элементы.ТабельДеревоЗначений.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
		Модифицированность = Истина;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Добавить сотрудника либо технику можно только к определенному составу ресурса.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРесурс(Команда)
	
	ТекущаяСтрока = Элементы.ТабельДеревоЗначений.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Работа) Тогда
		Если ТекущаяСтрока.ЭтоРабота Тогда
			
			СтрокиРесурсов = ТекущаяСтрока.ПолучитьЭлементы();
			НоваяСтрока = СтрокиРесурсов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.ЭтоРабота 		= Ложь;
			НоваяСтрока.ЭтоРесурс 		= Истина;
			НоваяСтрока.Работа 			= ТекущаяСтрока.Работа;
			НоваяСтрока.РаботаРесурс    = ПредопределенноеЗначение("Справочник.УСОERP_Ресурсы.ПустаяСсылка");
			НоваяСтрока.СоставРесурса 	= ПредопределенноеЗначение("Справочник.УСОERP_СоставРесурсов.ПустаяСсылка");
			НоваяСтрока.Ресурс 			= ПредопределенноеЗначение("Справочник.УСОERP_Ресурсы.ПустаяСсылка");
			
			Элементы.ТабельДеревоЗначений.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
			
		ИначеЕсли ТекущаяСтрока.ЭтоРесурс Тогда
			Родитель = ТекущаяСтрока.ПолучитьРодителя();
			СтрокиРесурсов = Родитель.ПолучитьЭлементы();
			НоваяСтрока = СтрокиРесурсов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Родитель);
			НоваяСтрока.ЭтоРабота 		= Ложь;
			НоваяСтрока.ЭтоРесурс 		= Истина;
			НоваяСтрока.Работа 			= ТекущаяСтрока.Работа;
			НоваяСтрока.РаботаРесурс    = ПредопределенноеЗначение("Справочник.УСОERP_Ресурсы.ПустаяСсылка");
			НоваяСтрока.СоставРесурса 	= ПредопределенноеЗначение("Справочник.УСОERP_СоставРесурсов.ПустаяСсылка");
			НоваяСтрока.Ресурс 			= ПредопределенноеЗначение("Справочник.УСОERP_Ресурсы.ПустаяСсылка");
			
			Элементы.ТабельДеревоЗначений.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Иначе
			РодительРесурс = ТекущаяСтрока.ПолучитьРодителя();
			РодительРабота = РодительРесурс.ПолучитьРодителя();
			СтрокиРесурсов = РодительРабота.ПолучитьЭлементы();
			НоваяСтрока = СтрокиРесурсов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РодительРабота);
			НоваяСтрока.ЭтоРабота 		= Ложь;
			НоваяСтрока.ЭтоРесурс 		= Истина;
			НоваяСтрока.Работа 			= РодительРабота.Работа;
			НоваяСтрока.РаботаРесурс    = ПредопределенноеЗначение("Справочник.УСОERP_Ресурсы.ПустаяСсылка");
			
			Элементы.ТабельДеревоЗначений.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
		Модифицированность = Истина;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Добавить ресурс можно только к определенной работе.");
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура РазбитьСтроку(Команда)
	ТекущаяСтрока = Элементы.ТабельДеревоЗначений.ТекущиеДанные;
	Попытка
	Если ЗначениеЗаполнено(ТекущаяСтрока.РаботаРесурс) Тогда
	Если ТипЗнч(ТекущаяСтрока.РаботаРесурс) = Тип("СправочникСсылка.УСОERP_Ресурсы") Тогда
		РодительСтроки = ТекущаяСтрока.ПолучитьРодителя();
		ЭлементыСтроки = РодительСтроки.ПолучитьЭлементы();   
	Иначе	 
		РодительСтроки = ТекущаяСтрока.ПолучитьРодителя();
		ЭлементыСтроки = ТекущаяСтрока.ПолучитьЭлементы();
	КонецЕсли;
	
	НоваяСтрока = ЭлементыСтроки.Добавить();
	НоваяСтрока.РаботаРодитель =  РодительСтроки;
	Иначе
		Элементы.ТабельДеревоЗначений.ДобавитьСтроку();
	КонецЕсли;
	Исключение
		Элементы.ТабельДеревоЗначений.ДобавитьСтроку();
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СводнаяИнформацияСкрытьПоказать(Команда)
	Элементы.ГруппаТабельСводно.Видимость = Не Элементы.ГруппаТабельСводно.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	СвернутьНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	РазвернутьНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТабельДеревоЗначений.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабельДеревоЗначений.ЭтоРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.ШрифтДиалоговИМеню,,,Истина));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаГруппировкиОтчета2);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТабельДеревоЗначений.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабельДеревоЗначений.ЭтоРесурс");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.ШрифтДиалоговИМеню,,,Истина));
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботаРесурс.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДолжностьТипМашинМеханизмов.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОбъемРабот.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СотрудникОсновноеСредство.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КоличествоЧасов1.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КоличествоЧасов2.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КоличествоЧасов3.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КоличествоЧасов4.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КоличествоЧасов5.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КоличествоЧасов6.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КоличествоЧасов7.Имя);


	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабельДеревоЗначений.ЭтоРесурс");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",Истина);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТабельДеревоЗначенийРаботаКодСДР.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабельДеревоЗначений.ЭтоРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",Истина);

	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТабельДеревоЗначенийРаботаКодСДР.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботаРесурс.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТабельДеревоЗначенийСоставРесурса.Имя);

	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабельДеревоЗначений.ЭтоРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабельДеревоЗначений.ЭтоРесурс");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;


	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",Истина);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_УчетРаботыСотрудниковТехники_ЗаполнитьНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиенте
Процедура ПрисвоитьЗаголовкиКолонкам()
	СчетчикЦикла = 1;
	ДатаНачала = Объект.НачалоПериода;
	ЗаголовокКолонки = ДатаНачала - 86400;
	Пока СчетчикЦикла<=7 Цикл
		ИмяКолонки = "КоличествоЧасов" + СчетчикЦикла;
		ИмяКолонкиСводно = "ТабельСводноТаблицаЗначенийКоличествоЧасов" + СчетчикЦикла;

		ЗаголовокКолонки = ЗаголовокКолонки + 86400;
		
		Элементы[ИмяКолонки].Заголовок = Формат(ЗаголовокКолонки, "ДФ=дд.ММ");
		Элементы[ИмяКолонкиСводно].Заголовок = Формат(ЗаголовокКолонки, "ДФ=дд.ММ");
		
		СчетчикЦикла = СчетчикЦикла + 1;
	КонецЦикла;		
КонецПроцедуры	

&НаСервере
Функция ОпределитьРесурсыИсполнителейРаботы(Работа)
	
	Запрос = Новый Запрос;
	Текст = 
    	"ВЫБРАТЬ
    	|	УСОERP_РесурсыРабочие.Должность КАК Исполнитель,
    	|	УСОERP_ПотребностьВРесурсахСрезПоследних.Ресурс,
    	|	ЕСТЬNULL(УСОERP_РесурсыРабочие.Количество, 0) КАК Количество
    	|ИЗ
    	|	РегистрСведений.УСОERP_ПотребностьВРесурсах.СрезПоследних(, ) КАК УСОERP_ПотребностьВРесурсахСрезПоследних
    	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УСОERP_Ресурсы.Рабочие КАК УСОERP_РесурсыРабочие
    	|		ПО УСОERP_ПотребностьВРесурсахСрезПоследних.Ресурс = УСОERP_РесурсыРабочие.Ссылка
    	|ГДЕ
    	|	УСОERP_ПотребностьВРесурсахСрезПоследних.Работа = &Работа
	    |И УСОERP_РесурсыРабочие.Должность ССЫЛКА Справочник.Должности";
	
	
	Если Не Объект.ОбъектСтроительства.ОтражатьФактРаботыВодителейТехникиПутевымиЛистами Тогда
		Текст = Текст + "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УСОERP_РесурсыМеханизмы.ТипМеханизма,
		|	УСОERP_ПотребностьВРесурсахСрезПоследних.Ресурс,
    	|	ЕСТЬNULL(УСОERP_РесурсыМеханизмы.Количество, 0) КАК Количество
		|ИЗ
		|	РегистрСведений.УСОERP_ПотребностьВРесурсах.СрезПоследних(, ) КАК УСОERP_ПотребностьВРесурсахСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УСОERP_Ресурсы.Механизмы КАК УСОERP_РесурсыМеханизмы
		|		ПО УСОERP_ПотребностьВРесурсахСрезПоследних.Ресурс = УСОERP_РесурсыМеханизмы.Ссылка
		|ГДЕ
		|	УСОERP_ПотребностьВРесурсахСрезПоследних.Работа = &Работа
		|	И УСОERP_РесурсыМеханизмы.ТипМеханизма ССЫЛКА Справочник.ТипыТранспортныхСредств";
	КонецЕсли;
	
	Запрос.Текст = Текст;	
	
	Запрос.УстановитьПараметр("Работа", Работа);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
КонецФункции	

&НаСервере
Функция ОпределитьСотрудникаОсновноеСредство(ТекущийРесурс, ТекущийСоставРесурса, ТекущийДолжностьТип)
	ДанныеВыбора = Новый СписокЗначений;
	СотрудникОсновноеСредствоНачалоВыбораНаСервере(ТекущийРесурс, ТекущийСоставРесурса, ТекущийДолжностьТип, ДанныеВыбора);
	Для Каждого СтрокаДанныеВыбора Из ДанныеВыбора Цикл
		Возврат СтрокаДанныеВыбора.Значение;
	КонецЦикла;	
КонецФункции	

&НаКлиенте
Процедура ОчиститьТабель(ОтветНаВопрос, Параметр) Экспорт
	Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
		Объект.ОбъектСтроительства = Параметр;
	Иначе
		ЭлементыДерева = ТабельДеревоЗначений.ПолучитьЭлементы();
		ЭлементыДерева.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтобразитьПоПриИзмененииНаСервере()
	
	мДеревоРабот = РеквизитФормыВЗначение("ТабельДеревоЗначений", Тип("ДеревоЗначений"));
		
	ТаблицаДанныхДляСводаПоТабелю = ТабельСводноТаблицаЗначений.Выгрузить();
	ТаблицаДанныхДляСводаПоТабелю.Очистить();
	Для Каждого СтрокаРабота Из мДеревоРабот.Строки Цикл
		Для Каждого СтрокаРесурс из СтрокаРабота.Строки цикл
			Для Каждого СтрокаСостава из СтрокаРесурс.Строки цикл
				 НоваяСтрока = ТаблицаДанныхДляСводаПоТабелю.Добавить();
				 ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСостава);
				 
				 Если ОтобразитьПо = "Исполнителям" Тогда
					 НоваяСтрока.Значение = СтрокаСостава.СотрудникОсновноеСредство;
				 Иначе
					 НоваяСтрока.Значение = СтрокаСостава.Ресурс;
				 КонецЕсли;
				 НоваяСтрока.КоличествоЧасовИтог = НоваяСтрока.КоличествоЧасов1
				 									+ НоваяСтрока.КоличествоЧасов2
				 				 					+ НоваяСтрока.КоличествоЧасов3
				 				 					+ НоваяСтрока.КоличествоЧасов4
				 				 					+ НоваяСтрока.КоличествоЧасов5
				 				 					+ НоваяСтрока.КоличествоЧасов6
				 				 					+ НоваяСтрока.КоличествоЧасов7;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаДанныхДляСводаПоТабелю.Свернуть("Значение", "КоличествоЧасов1, КоличествоЧасов2, КоличествоЧасов3, КоличествоЧасов4, КоличествоЧасов5, КоличествоЧасов6, КоличествоЧасов7, КоличествоЧасовИтог");
	
	ТабельСводноТаблицаЗначений.Загрузить(ТаблицаДанныхДляСводаПоТабелю);
	
	Если ОтобразитьПо = "Исполнителям" Тогда
		Элементы.ТабельСводноТаблицаЗначенийЗначение.Заголовок = "Исполнитель";
	Иначе
		Элементы.ТабельСводноТаблицаЗначенийЗначение.Заголовок = "Ресурс";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникОсновноеСредствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрокаТабель	 = Элементы.ТабельДеревоЗначений.ТекущиеДанные;
	ТекущийРесурс        = ТекущаяСтрокаТабель.РаботаРесурс;
	ТекущийДолжностьТип  = ТекущаяСтрокаТабель.ДолжностьТипМашинМеханизмов;
	ТекущийСоставРесурса = ТекущаяСтрокаТабель.СоставРесурса;
	ДанныеВыбора = Новый СписокЗначений;
	СотрудникОсновноеСредствоНачалоВыбораНаСервере(ТекущийРесурс, ТекущийСоставРесурса, ТекущийДолжностьТип, ДанныеВыбора);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СотрудникОсновноеСредствоНачалоВыбораНаСервере(ТекущийРесурс, ТекущийСоставРесурса, ТекущийДолжностьТип, ДанныеВыбора)
	Если ТипЗнч(ТекущийРесурс) = Тип("СправочникСсылка.УСОERP_Ресурсы") Тогда
		Если ТипЗнч(ТекущийДолжностьТип) = Тип("СправочникСсылка.ТипыТранспортныхСредств") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	УСОERP_СоставРесурсовМеханизмы.Механизм КАК Механизм
			|ИЗ
			|	Справочник.УСОERP_СоставРесурсов.Механизмы КАК УСОERP_СоставРесурсовМеханизмы
			|ГДЕ
			|	УСОERP_СоставРесурсовМеханизмы.Ссылка.Ресурс = &Ресурс
			|	И УСОERP_СоставРесурсовМеханизмы.Ссылка = &ТекущийСоставРесурса";
			
			Запрос.УстановитьПараметр("ТекущийСоставРесурса", ТекущийСоставРесурса);
			Запрос.УстановитьПараметр("Ресурс", ТекущийРесурс);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ДанныеВыбора.Добавить(ВыборкаДетальныеЗаписи.Механизм);
			КонецЦикла;
			
			
		ИначеЕсли	ТипЗнч(ТекущийДолжностьТип) = Тип("СправочникСсылка.Должности") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	УСОERP_СоставРесурсовРабочие.Сотрудник КАК Сотрудник
			|ИЗ
			|	Справочник.УСОERP_СоставРесурсов.Рабочие КАК УСОERP_СоставРесурсовРабочие
			|ГДЕ
			|	УСОERP_СоставРесурсовРабочие.Ссылка.Ресурс = &Ресурс
			|	И УСОERP_СоставРесурсовРабочие.Ссылка = &ТекущийСоставРесурса";
			
			Запрос.УстановитьПараметр("ТекущийСоставРесурса", ТекущийСоставРесурса);
			Запрос.УстановитьПараметр("Ресурс", ТекущийРесурс);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ДанныеВыбора.Добавить(ВыборкаДетальныеЗаписи.Сотрудник);
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьНаКлиенте(мТекущаяСтрока = Неопределено)
	
	Если мТекущаяСтрока = Неопределено Тогда
		КоллекцияЭлементовДерева = ТабельДеревоЗначений.ПолучитьЭлементы();
	Иначе
		КоллекцияЭлементовДерева = мТекущаяСтрока.ПолучитьЭлементы();
	КонецЕсли;
	
		
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		ИдентификаторСтроки	= Строка.ПолучитьИдентификатор();
		Элементы.ТабельДеревоЗначений.Свернуть(ИдентификаторСтроки);
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьНаКлиенте(мТекущаяСтрока = Неопределено)
	
	Если мТекущаяСтрока = Неопределено Тогда
		КоллекцияЭлементовДерева = ТабельДеревоЗначений.ПолучитьЭлементы();
	Иначе
		КоллекцияЭлементовДерева = мТекущаяСтрока.ПолучитьЭлементы();
	КонецЕсли;

	
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		ИдентификаторСтроки	= Строка.ПолучитьИдентификатор();
		Элементы.ТабельДеревоЗначений.Развернуть(ИдентификаторСтроки);
		
		Если Строка.ПолучитьЭлементы().количество()>0 Тогда
			РазвернутьНаКлиенте(Строка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборРесурсаНаСервере(ИдентификаторСтроки)
	
	ТекущаяСтрока = ТабельДеревоЗначений.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ТекущаяСтрока.Ресурс = ТекущаяСтрока.РаботаРесурс;
	
	СоставИзменился = Ложь;
	
	СоставРесурса = ТекущаяСтрока.ПолучитьЭлементы();
	Если СоставРесурса.Количество() > 0 Тогда
		Если СоставРесурса[0].Ресурс <> ТекущаяСтрока.Ресурс Тогда
			ТекущаяСтрока.ПолучитьЭлементы().Очистить();
			СоставИзменился = Истина;
		КонецЕсли;
		
	Иначе
		СоставИзменился = Истина;
	КонецЕсли;

	Если СоставИзменился Тогда
		ТекущаяСтрока.СоставРесурса = Справочники.УСОERP_СоставРесурсов.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборСоставаРесурсаНаСервере(ИдентификаторСтроки)
	
	ТекущаяСтрока = ТабельДеревоЗначений.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СоставИзменился = Ложь;
	
	СоставРесурса = ТекущаяСтрока.ПолучитьЭлементы();
	Если СоставРесурса.Количество() > 0 Тогда
		Если СоставРесурса[0].СоставРесурса <> ТекущаяСтрока.СоставРесурса Тогда
			ТекущаяСтрока.ПолучитьЭлементы().Очистить();
			СоставИзменился = Истина;
		КонецЕсли;
	Иначе
		СоставИзменился = Истина;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ТекущаяСтрока.СоставРесурса)
		И СоставИзменился Тогда
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УСОERP_СоставРесурсовРабочие.Должность,
		|	УСОERP_СоставРесурсовРабочие.Сотрудник
		|ИЗ
		|	Справочник.УСОERP_СоставРесурсов.Рабочие КАК УСОERP_СоставРесурсовРабочие
		|ГДЕ
		|	УСОERP_СоставРесурсовРабочие.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УСОERP_СоставРесурсовМеханизмы.ТипМеханизма,
		|	УСОERP_СоставРесурсовМеханизмы.Механизм
		|ИЗ
		|	Справочник.УСОERP_СоставРесурсов.Механизмы КАК УСОERP_СоставРесурсовМеханизмы
		|ГДЕ
		|	УСОERP_СоставРесурсовМеханизмы.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ТекущаяСтрока.СоставРесурса);
		
		Результат = Запрос.ВыполнитьПакет();
		
		ТаблицаИсполнителей = Результат[0].Выгрузить();
		ТаблицаМеханизмов 	= Результат[1].Выгрузить();
		
		
		ЭлементыСостава = ТекущаяСтрока.ПолучитьЭлементы();
		
		Для Каждого СтрокаИсполнитель Из ТаблицаИсполнителей Цикл
			ЭлементИсполнитель = ЭлементыСостава.Добавить();
			ЗаполнитьЗначенияСвойств(ЭлементИсполнитель,ТекущаяСтрока); 
			ЗаполнитьЗначенияСвойств(ЭлементИсполнитель, СтрокаИсполнитель);
			ЭлементИсполнитель.ДолжностьТипМашинМеханизмов 	= СтрокаИсполнитель.Должность;
			ЭлементИсполнитель.СотрудникОсновноеСредство 	= СтрокаИсполнитель.Сотрудник;
			ЭлементИсполнитель.ЭтоРабота 		= Ложь;
			ЭлементИсполнитель.ЭтоРесурс 		= Ложь;
			ЭлементИсполнитель.Работа 			= ТекущаяСтрока.Работа;
			ЭлементИсполнитель.Ресурс 			= ТекущаяСтрока.Ресурс;
			ЭлементИсполнитель.СоставРесурса 	= ТекущаяСтрока.СоставРесурса;
						
		КонецЦикла;
		
        Для Каждого СтрокаМеханизм Из ТаблицаМеханизмов Цикл
			ЭлементМеханизм = ЭлементыСостава.Добавить();
			ЗаполнитьЗначенияСвойств(ЭлементМеханизм,ТекущаяСтрока); 
			ЗаполнитьЗначенияСвойств(ЭлементМеханизм, СтрокаМеханизм);
			ЭлементМеханизм.ДолжностьТипМашинМеханизмов 	= СтрокаМеханизм.ТипМеханизма;
			ЭлементМеханизм.СотрудникОсновноеСредство 		= СтрокаМеханизм.Механизм;
			ЭлементМеханизм.ЭтоРабота 		= Ложь;
			ЭлементМеханизм.ЭтоРесурс 		= Ложь;
			ЭлементМеханизм.Работа 			= ТекущаяСтрока.Работа;
			ЭлементМеханизм.Ресурс 			= ТекущаяСтрока.Ресурс;
			ЭлементМеханизм.СоставРесурса 	= ТекущаяСтрока.СоставРесурса;
		КонецЦикла;

		
	ИначеЕсли Не ЗначениеЗаполнено(ТекущаяСтрока.СоставРесурса) Тогда
		
		ТекущаяСтрока.ПолучитьЭлементы().Очистить();
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьТабельИзДереваЗначений(ТекущийОбъект)
	
	Табель = ТекущийОбъект.Табель;
	мДеревоРабот = РеквизитФормыВЗначение("ТабельДеревоЗначений", Тип("ДеревоЗначений"));
	
	Для Каждого СтрокаРабота Из мДеревоРабот.Строки Цикл
		Для Каждого СтрокаРесурс Из СтрокаРабота.Строки Цикл
			НомерСтрокиРесурса = Табель.Количество() + 1;
			Если СтрокаРесурс.Строки.Количество()>0 Тогда
				Для Каждого СтрокаСостава Из СтрокаРесурс.Строки Цикл
					НоваяСтрока = Табель.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаСостава);
					НоваяСтрока.НомерСтрокиРесурса = НомерСтрокиРесурса;
					НоваяСтрока.Работа = СтрокаРабота.Работа;
				КонецЦикла;
			Иначе
				НоваяСтрока = Табель.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаРесурс);
				НоваяСтрока.НомерСтрокиРесурса = НомерСтрокиРесурса;
				НоваяСтрока.Работа = СтрокаРабота.Работа;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоЗначенийПриСоздании()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.НомерСтроки КАК НомерСтроки,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ресурс,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Работа,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.ОбъемРабот,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.СоставРесурса,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.ДолжностьТипМашинМеханизмов,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.СотрудникОсновноеСредство,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов1,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов2,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов3,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов4,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов5,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов6,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.КоличествоЧасов7,
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.НомерСтрокиРесурса КАК НомерСтрокиРесурса
	|ИЗ
	|	Документ.УСОERP_УчетРаботыСотрудниковТехники.Табель КАК УСОERP_УчетРаботыСотрудниковТехникиТабель
	|ГДЕ
	|	УСОERP_УчетРаботыСотрудниковТехникиТабель.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	НомерСтрокиРесурса";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТаблицаРабот = Результат.Скопировать();
	ТаблицаРабот.Свернуть("Работа, ОбъемРабот");
	
	мДеревоТабель = РеквизитФормыВЗначение("ТабельДеревоЗначений", Тип("ДеревоЗначений"));
	мДеревоТабель.Строки.Очистить();
	
	ТаблицаРесурсовОбщая = Результат.Скопировать();
	ТаблицаРесурсовОбщая.Свернуть("Работа, Ресурс, НомерСтрокиРесурса");
	
	ДанныеДляДерева = Новый ДеревоЗначений;
	МассивТипов_ДолжностьТипМашинМеханизмов = Новый Массив;
	МассивТипов_ДолжностьТипМашинМеханизмов.Добавить(Тип("СправочникСсылка.Должности"));
	МассивТипов_ДолжностьТипМашинМеханизмов.Добавить(Тип("СправочникСсылка.ТипыТранспортныхСредств"));
	
	МассивТипов_Работа = Новый Массив;
	МассивТипов_Работа.Добавить(Тип("СправочникСсылка.УСОERP_СтроительныеРаботы"));
	МассивТипов_Работа.Добавить(Тип("СправочникСсылка.УСОERP_Ресурсы"));
	МассивТипов_Работа.Добавить(Тип("СправочникСсылка.Должности"));
	МассивТипов_Работа.Добавить(Тип("СправочникСсылка.ТипыТранспортныхСредств"));
	
	МассивТипов_РаботаРесурс = Новый Массив;
	МассивТипов_РаботаРесурс.Добавить(Тип("СправочникСсылка.УСОERP_СтроительныеРаботы"));
	МассивТипов_РаботаРесурс.Добавить(Тип("СправочникСсылка.УСОERP_Ресурсы"));
	
	МассивТипов_СотрудникОсновноеСредство = Новый Массив;
	МассивТипов_СотрудникОсновноеСредство.Добавить(Тип("СправочникСсылка.ОбъектыЭксплуатации"));
	МассивТипов_СотрудникОсновноеСредство.Добавить(Тип("СправочникСсылка.Сотрудники"));
	
	ДанныеДляДерева.Колонки.Добавить("Работа",                      Новый ОписаниеТипов(МассивТипов_Работа)); 
	ДанныеДляДерева.Колонки.Добавить("РаботаРодитель",              Новый ОписаниеТипов(МассивТипов_Работа)); 
	ДанныеДляДерева.Колонки.Добавить("КодСДР",                      Новый ОписаниеТипов("Строка")); 
	ДанныеДляДерева.Колонки.Добавить("НомерРаботыВУровне",          Новый ОписаниеТипов("Число")); 
	ДанныеДляДерева.Колонки.Добавить("ДолжностьТипМашинМеханизмов", Новый ОписаниеТипов(МассивТипов_ДолжностьТипМашинМеханизмов));
	ДанныеДляДерева.Колонки.Добавить("КоличествоЧасов1",            Новый ОписаниеТипов("Число"));
	ДанныеДляДерева.Колонки.Добавить("КоличествоЧасов2",            Новый ОписаниеТипов("Число"));
	ДанныеДляДерева.Колонки.Добавить("КоличествоЧасов3",            Новый ОписаниеТипов("Число"));
	ДанныеДляДерева.Колонки.Добавить("КоличествоЧасов4",            Новый ОписаниеТипов("Число"));
	ДанныеДляДерева.Колонки.Добавить("КоличествоЧасов5",            Новый ОписаниеТипов("Число"));
	ДанныеДляДерева.Колонки.Добавить("КоличествоЧасов6",            Новый ОписаниеТипов("Число"));
	ДанныеДляДерева.Колонки.Добавить("КоличествоЧасов7",            Новый ОписаниеТипов("Число"));
	ДанныеДляДерева.Колонки.Добавить("ОбъемРабот",                  Новый ОписаниеТипов("Число"));
	ДанныеДляДерева.Колонки.Добавить("РаботаРесурс",                Новый ОписаниеТипов(МассивТипов_РаботаРесурс));
	ДанныеДляДерева.Колонки.Добавить("Ресурс",                      Новый ОписаниеТипов("СправочникСсылка.УСОERP_Ресурсы"));
	ДанныеДляДерева.Колонки.Добавить("СоставРесурса",               Новый ОписаниеТипов("СправочникСсылка.УСОERP_СоставРесурсов"));
	ДанныеДляДерева.Колонки.Добавить("СотрудникОсновноеСредство",   Новый ОписаниеТипов(МассивТипов_СотрудникОсновноеСредство));
	ДанныеДляДерева.Колонки.Добавить("ЭтоРабота",                   Новый ОписаниеТипов("Булево"));
	ДанныеДляДерева.Колонки.Добавить("ЭтоРесурс",                   Новый ОписаниеТипов("Булево"));

	Для Каждого СтрокаРабота Из ТаблицаРабот Цикл
		
		НоваяСтрокаДерева_Работа = ДанныеДляДерева.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДерева_Работа, СтрокаРабота);
		НоваяСтрокаДерева_Работа.ЭтоРабота          = Истина;
		НоваяСтрокаДерева_Работа.РаботаРесурс       = СтрокаРабота.Работа; 			
		НоваяСтрокаДерева_Работа.РаботаРодитель     = СтрокаРабота.Работа.Родитель;
		НоваяСтрокаДерева_Работа.КодСДР             = СтрокаРабота.Работа.КодСДР; 			
		НоваяСтрокаДерева_Работа.НомерРаботыВУровне = СтрокаРабота.Работа.НомерРаботыВУровне; 			
		
		ТаблицаРесурсов = ТаблицаРесурсовОбщая.Скопировать(Новый Структура("Работа", СтрокаРабота.Работа)); 
		Результат.Скопировать(Новый Структура("Работа", СтрокаРабота.Работа));
		
		Для Каждого СтрокаРесурс из ТаблицаРесурсов Цикл
			НоваяСтрокаДерева_Ресурс = НоваяСтрокаДерева_Работа.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДерева_Ресурс, СтрокаРабота);
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДерева_Ресурс, СтрокаРесурс);
			
			НоваяСтрокаДерева_Ресурс.ЭтоРабота 		= Ложь;
			НоваяСтрокаДерева_Ресурс.ЭтоРесурс 		= Истина;
			НоваяСтрокаДерева_Ресурс.РаботаРесурс 	= СтрокаРесурс.Ресурс;
			
			НоваяСтрокаДерева_Ресурс.Работа             = СтрокаРесурс.Ресурс;
			НоваяСтрокаДерева_Ресурс.РаботаРодитель     = НоваяСтрокаДерева_Работа.Работа;
			НоваяСтрокаДерева_Ресурс.КодСДР             = Неопределено; 			
			НоваяСтрокаДерева_Ресурс.НомерРаботыВУровне = Неопределено; 			
			
			
			ТаблицаСостава = Результат.Скопировать(Новый Структура("Работа, Ресурс, НомерСтрокиРесурса", СтрокаРабота.Работа, СтрокаРесурс.Ресурс, СтрокаРесурс.НомерСтрокиРесурса));
			ЭтоПервый = Истина;
			Для Каждого СтрокаСостава из ТаблицаСостава Цикл
				Если НЕ ЗначениеЗаполнено(СтрокаСостава.СоставРесурса) Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЭтоПервый Тогда
					НоваяСтрокаДерева_Ресурс.СоставРесурса = СтрокаСостава.СоставРесурса;
					ЭтоПервый = Ложь;
				КонецЕсли;
				
				НоваяСтрокаДерева_Состава = НоваяСтрокаДерева_Ресурс.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаДерева_Состава, СтрокаРабота);
				ЗаполнитьЗначенияСвойств(НоваяСтрокаДерева_Состава, СтрокаРесурс);
				ЗаполнитьЗначенияСвойств(НоваяСтрокаДерева_Состава, СтрокаСостава);
				
				НоваяСтрокаДерева_Состава.ЭтоРабота 		= Ложь;
				НоваяСтрокаДерева_Состава.ЭтоРесурс 		= Ложь;
				НоваяСтрокаДерева_Состава.РаботаРесурс 	= СтрокаРесурс.Ресурс;
				
				НоваяСтрокаДерева_Состава.Работа             = НоваяСтрокаДерева_Состава.ДолжностьТипМашинМеханизмов;
				НоваяСтрокаДерева_Состава.РаботаРодитель     = НоваяСтрокаДерева_Ресурс.Работа;
				НоваяСтрокаДерева_Состава.КодСДР             = Неопределено; 			
				НоваяСтрокаДерева_Состава.НомерРаботыВУровне = Неопределено; 			
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла; 
	
	//ВыражениеИсточник = "Работа";
	//ВыражениеПриемник = "РаботаРодитель" ;
	//Справочник        = Справочники.УСОERP_СтроительныеРаботы;
	//ДеревоРезультат     = УСОERP_ОбработкаТабличныхЧастей.УСОERP_ПодготовитьДанныеИСформироватьДеревоСВосстановлениемСтруктуры(ДанныеДляДерева,ВыражениеИсточник,ВыражениеПриемник,"РаботаРесурс",Справочник); 

	//ВремРодноеДерево = РеквизитФормыВЗначение("ТабельДеревоЗначений"); // берется родная структура с родной типизацией
	//ВремРодноеДерево.Строки.Очистить();
	//УСОERP_ОбработкаТабличныхЧастей.УСОERP_ЗаполнитьРоднуюСтруктуруДереваИзВнешнего(ВремРодноеДерево.Строки, ДеревоРезультат.Строки); // и рекурсивно заполняется из дерева, где, возможн, типиация создаст проблемы
	//ЗначениеВРеквизитФормы(ВремРодноеДерево, "ТабельДеревоЗначений");
	//ВремРодноеДерево.Строки.Очистить(); // уборка за собой
	
	ЗначениеВРеквизитФормы(ДанныеДляДерева, "ТабельДеревоЗначений");
	
КонецПроцедуры

&НаСервере
Процедура ДокументУтвержденияПриИзмененииНаСервере()
	НовыйВариант = Объект.ДокументУтверждения.СценарийПланирования.НовыйВариант = Истина;
	Объект.НаправлениеДеятельности = Объект.ДокументУтверждения.НаправлениеДеятельности;
КонецПроцедуры

&НаКлиенте
Процедура ДокументУтвержденияПриИзменении(Элемент)
	ДокументУтвержденияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДокументУтвержденияОчистка(Элемент, СтандартнаяОбработка)
	ДокументУтвержденияПриИзмененииНаСервере(); 
КонецПроцедуры

&НаКлиенте
Процедура ТабельДеревоЗначенийПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОтобразитьПоПриИзмененииНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабельДеревоЗначенийПослеУдаления(Элемент)
	
	ОтобразитьПоПриИзмененииНаСервере();
	Модифицированность = Истина; 

КонецПроцедуры

#КонецОбласти
